GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_gpt.h
/******************************************************************************
*  Filename:       hw_gpt.h
*  Revised:        2015-01-15 18:41:47 +0100 (to, 15 jan 2015)
*  Revision:       42400
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_GPT_H__
#define __HW_GPT_H__


//*****************************************************************************
//
// This section defines the register offsets of
// GPT component
//
//*****************************************************************************
// GPT Configuration
#define GPT_O_CFG                                                   0x00000000

// GPT Timer A Mode
#define GPT_O_TAMR                                                  0x00000004

// GPT Timer B Mode
#define GPT_O_TBMR                                                  0x00000008

// GPT Control
#define GPT_O_CTL                                                   0x0000000C

// GPT Synch Register
#define GPT_O_SYNC                                                  0x00000010

// GPT Interrupt Mask
#define GPT_O_IMR                                                   0x00000018

// GPT Raw Interrupt Status
#define GPT_O_RIS                                                   0x0000001C

// GPT Masked Interrupt Status
#define GPT_O_MIS                                                   0x00000020

// GPT Interrupt Clear
#define GPT_O_ICLR                                                  0x00000024

// GPT Timer A Interval Load  Register
#define GPT_O_TAILR                                                 0x00000028

// GPT Timer B Interval Load  Register
#define GPT_O_TBILR                                                 0x0000002C

// GPT Timer A Match Register
#define GPT_O_TAMATCHR                                              0x00000030

// GPT Timer B Match Register
#define GPT_O_TBMATCHR                                              0x00000034

// GPT Timer A Pre-scale
#define GPT_O_TAPR                                                  0x00000038

// GPT Timer B Pre-scale
#define GPT_O_TBPR                                                  0x0000003C

// GPT Timer A Pre-scale Match
#define GPT_O_TAPMR                                                 0x00000040

// GPT Timer B Pre-scale Match
#define GPT_O_TBPMR                                                 0x00000044

// GPT Timer A Register
#define GPT_O_TAR                                                   0x00000048

// GPT Timer B Register
#define GPT_O_TBR                                                   0x0000004C

// GPT Timer A Value
#define GPT_O_TAV                                                   0x00000050

// GPT Timer B Value
#define GPT_O_TBV                                                   0x00000054

// GPT RTC Pre-divide Value
#define GPT_O_RTCPD                                                 0x00000058

// GPT Timer A Pre-scale Snap-shot
#define GPT_O_TAPS                                                  0x0000005C

// GPT Timer A Pre-scale Snap-shot
#define GPT_O_TBPS                                                  0x00000060

// GPT Timer A Pre-scale Value
#define GPT_O_TAPV                                                  0x00000064

// GPT Timer B Pre-scale Value
#define GPT_O_TBPV                                                  0x00000068

// GPT DMA Event
#define GPT_O_DMAEV                                                 0x0000006C

// GPT ADC Event
#define GPT_O_ADCEV                                                 0x00000070

// GPT Peripheral Version
#define GPT_O_VERSION                                               0x00000FB0

// GPT Combined CCP Output
#define GPT_O_ANDCCP                                                0x00000FB4

//*****************************************************************************
//
// Register: GPT_O_CFG
//
//*****************************************************************************
// Field: [2:0] CFG
//
// GPT Configuration
// 0x2- 0x3 - Reserved
// 0x5- 0x7 - Reserved
// ENUMs:
// 32BIT_TIMER          32-bit timer configuration
// REALTIME_CLOCK       32-bit real-time clock
// 16BIT_TIMER          16-bit timer configuration.
// Configure for two 16-bit timers.
// Also see TAMR.TAMR and TBMR.TBMR.
//
#define GPT_CFG_CFG_M                                               0x00000007
#define GPT_CFG_CFG_S                                               0
#define GPT_CFG_CFG_32BIT_TIMER                                     0x00000000
#define GPT_CFG_CFG_REALTIME_CLOCK                                  0x00000001
#define GPT_CFG_CFG_16BIT_TIMER                                     0x00000004

//*****************************************************************************
//
// Register: GPT_O_TAMR
//
//*****************************************************************************
// Field: [15:13] TCACT
//
// Timer Compare Action Select
//
// ENUMs:
// DIS_CMP              Disable compare operations
// TOG_ON_TO            Toggle State on Time-Out
// CLR_ON_TO            Clear CCP output pin on Time-Out
// SET_ON_TO            Set CCP output pin on Time-Out
// SETTOG_ON_TO         Set CCP output pin immediately and toggle on Time-Out
// CLRTOG_ON_TO         Clear CCP output pin immediately and toggle on Time-Out
// SETCLR_ON_TO         Set CCP output pin immediately and clear on Time-Out
// CLRSET_ON_TO         Clear CCP output pin immediately and set on Time-Out
//
#define GPT_TAMR_TCACT_M                                            0x0000E000
#define GPT_TAMR_TCACT_S                                            13
#define GPT_TAMR_TCACT_DIS_CMP                                      0x00000000
#define GPT_TAMR_TCACT_TOG_ON_TO                                    0x00002000
#define GPT_TAMR_TCACT_CLR_ON_TO                                    0x00004000
#define GPT_TAMR_TCACT_SET_ON_TO                                    0x00006000
#define GPT_TAMR_TCACT_SETTOG_ON_TO                                 0x00008000
#define GPT_TAMR_TCACT_CLRTOG_ON_TO                                 0x0000A000
#define GPT_TAMR_TCACT_SETCLR_ON_TO                                 0x0000C000
#define GPT_TAMR_TCACT_CLRSET_ON_TO                                 0x0000E000

// Field: [12]    TACINTD
//
// One-Shot/Periodic Interrupt Disable
// ENUMs:
// EN_TO_INTR           Time-out interrupt function as normal
// DIS_TO_INTR          Time-out interrupt are disabled
//
#define GPT_TAMR_TACINTD                                            0x00001000
#define GPT_TAMR_TACINTD_BITN                                       12
#define GPT_TAMR_TACINTD_M                                          0x00001000
#define GPT_TAMR_TACINTD_S                                          12
#define GPT_TAMR_TACINTD_EN_TO_INTR                                 0x00000000
#define GPT_TAMR_TACINTD_DIS_TO_INTR                                0x00001000

// Field: [11]    TAPLO
//
// Legacy PWM operation
// ENUMs:
// LEGACY               Legacy operation
// CCP_ON_TO            CCP output pin is set to 1 on time-out
//
#define GPT_TAMR_TAPLO                                              0x00000800
#define GPT_TAMR_TAPLO_BITN                                         11
#define GPT_TAMR_TAPLO_M                                            0x00000800
#define GPT_TAMR_TAPLO_S                                            11
#define GPT_TAMR_TAPLO_LEGACY                                       0x00000000
#define GPT_TAMR_TAPLO_CCP_ON_TO                                    0x00000800

